; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p8)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 a3 - Aircraft
 c1 c2 c3 c4 c5 c6 c7 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c5)
(fuel-level a2 f2) (at a2 c4)
(fuel-level a3 f2) (at a3 c4)
(at p1 c2)
(at p2 c1)
(at p3 c1)
(at p4 c1)
(at p5 c2)
(at p6 c2)
(at p7 c2)
(at p8 c3)
(at p9 c5)
(at p10 c3)
(at p11 c2)
(at p12 c6)
(at p13 c3)
(at p14 c4)
(at p15 c4)
(at p16 c2)
(at p17 c1)
(at p18 c3)
(at p19 c4)
(at p20 c7)
(at p21 c5)
)
(:goal (and
(at a1 c5)
(at a2 c4)
(at a3 c4)
(at p1 c7)
(at p2 c3)
(at p3 c3)
(at p4 c5)
(at p5 c5)
(at p6 c2)
(at p7 c2)
(at p8 c4)
(at p9 c3)
(at p10 c2)
(at p11 c1)
(at p12 c6)
(at p13 c1)
(at p14 c1)
(at p15 c3)
(at p16 c1)
(at p17 c4)
(at p18 c7)
(at p19 c3)
(at p20 c2)
(at p21 c7)
))
)

; plan
1. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 5 of 24
2. (board p1 a1 c2)
   deleted: (at p1 c2)
   added: (in p1 a1)
   goals met: 5 of 24
3. (fly a1 c2 c7 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c7) (fuel-level a1 f0)
   goals met: 5 of 24
4. (debark p1 a1 c7)
   deleted: (in p1 a1)
   added: (at p1 c7)
   goals met: 6 of 24
5. (fly a3 c4 c1 f2 f1)
   deleted: (at a3 c4) (fuel-level a3 f2)
   added: (at a3 c1) (fuel-level a3 f1)
   goals met: 5 of 24
6. (board p2 a3 c1)
   deleted: (at p2 c1)
   added: (in p2 a3)
   goals met: 5 of 24
7. (fly a3 c1 c3 f1 f0)
   deleted: (at a3 c1) (fuel-level a3 f1)
   added: (at a3 c3) (fuel-level a3 f0)
   goals met: 5 of 24
8. (debark p2 a3 c3)
   deleted: (in p2 a3)
   added: (at p2 c3)
   goals met: 6 of 24
9. (fly a2 c4 c1 f2 f1)
   deleted: (at a2 c4) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 5 of 24
10. (board p3 a2 c1)
   deleted: (at p3 c1)
   added: (in p3 a2)
   goals met: 5 of 24
11. (fly a2 c1 c3 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 5 of 24
12. (debark p3 a2 c3)
   deleted: (in p3 a2)
   added: (at p3 c3)
   goals met: 6 of 24
13. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 6 of 24
14. (fly a1 c7 c1 f2 f1)
   deleted: (at a1 c7) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 6 of 24
15. (board p4 a1 c1)
   deleted: (at p4 c1)
   added: (in p4 a1)
   goals met: 6 of 24
16. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 7 of 24
17. (debark p4 a1 c5)
   deleted: (in p4 a1)
   added: (at p4 c5)
   goals met: 8 of 24
18. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 24
19. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 7 of 24
20. (board p5 a1 c2)
   deleted: (at p5 c2)
   added: (in p5 a1)
   goals met: 7 of 24
21. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 8 of 24
22. (debark p5 a1 c5)
   deleted: (in p5 a1)
   added: (at p5 c5)
   goals met: 9 of 24
23. (board p8 a2 c3)
   deleted: (at p8 c3)
   added: (in p8 a2)
   goals met: 9 of 24
24. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 9 of 24
25. (fly a2 c3 c4 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c4) (fuel-level a2 f1)
   goals met: 10 of 24
26. (debark p8 a2 c4)
   deleted: (in p8 a2)
   added: (at p8 c4)
   goals met: 11 of 24
27. (board p9 a1 c5)
   deleted: (at p9 c5)
   added: (in p9 a1)
   goals met: 11 of 24
28. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 11 of 24
29. (fly a1 c5 c3 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 10 of 24
30. (debark p9 a1 c3)
   deleted: (in p9 a1)
   added: (at p9 c3)
   goals met: 11 of 24
31. (board p10 a1 c3)
   deleted: (at p10 c3)
   added: (in p10 a1)
   goals met: 11 of 24
32. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 11 of 24
33. (debark p10 a1 c2)
   deleted: (in p10 a1)
   added: (at p10 c2)
   goals met: 12 of 24
34. (board p11 a1 c2)
   deleted: (at p11 c2)
   added: (in p11 a1)
   goals met: 12 of 24
35. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 12 of 24
36. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 12 of 24
37. (debark p11 a1 c1)
   deleted: (in p11 a1)
   added: (at p11 c1)
   goals met: 13 of 24
38. (board p13 a3 c3)
   deleted: (at p13 c3)
   added: (in p13 a3)
   goals met: 13 of 24
39. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 13 of 24
40. (fly a3 c3 c1 f2 f1)
   deleted: (at a3 c3) (fuel-level a3 f2)
   added: (at a3 c1) (fuel-level a3 f1)
   goals met: 13 of 24
41. (debark p13 a3 c1)
   deleted: (in p13 a3)
   added: (at p13 c1)
   goals met: 14 of 24
42. (board p14 a2 c4)
   deleted: (at p14 c4)
   added: (in p14 a2)
   goals met: 14 of 24
43. (fly a2 c4 c1 f1 f0)
   deleted: (at a2 c4) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 13 of 24
44. (debark p14 a2 c1)
   deleted: (in p14 a2)
   added: (at p14 c1)
   goals met: 14 of 24
45. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 14 of 24
46. (board p15 a1 c4)
   deleted: (at p15 c4)
   added: (in p15 a1)
   goals met: 14 of 24
47. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 14 of 24
48. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 14 of 24
49. (debark p15 a1 c3)
   deleted: (in p15 a1)
   added: (at p15 c3)
   goals met: 15 of 24
50. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 15 of 24
51. (board p16 a1 c2)
   deleted: (at p16 c2)
   added: (in p16 a1)
   goals met: 15 of 24
52. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 24
53. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 15 of 24
54. (debark p16 a1 c1)
   deleted: (in p16 a1)
   added: (at p16 c1)
   goals met: 16 of 24
55. (board p17 a1 c1)
   deleted: (at p17 c1)
   added: (in p17 a1)
   goals met: 16 of 24
56. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 16 of 24
57. (debark p17 a1 c4)
   deleted: (in p17 a1)
   added: (at p17 c4)
   goals met: 17 of 24
58. (fly a3 c1 c3 f1 f0)
   deleted: (at a3 c1) (fuel-level a3 f1)
   added: (at a3 c3) (fuel-level a3 f0)
   goals met: 17 of 24
59. (board p18 a3 c3)
   deleted: (at p18 c3)
   added: (in p18 a3)
   goals met: 17 of 24
60. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 17 of 24
61. (fly a3 c3 c7 f2 f1)
   deleted: (at a3 c3) (fuel-level a3 f2)
   added: (at a3 c7) (fuel-level a3 f1)
   goals met: 17 of 24
62. (debark p18 a3 c7)
   deleted: (in p18 a3)
   added: (at p18 c7)
   goals met: 18 of 24
63. (board p19 a1 c4)
   deleted: (at p19 c4)
   added: (in p19 a1)
   goals met: 18 of 24
64. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 24
65. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 18 of 24
66. (debark p19 a1 c3)
   deleted: (in p19 a1)
   added: (at p19 c3)
   goals met: 19 of 24
67. (board p20 a3 c7)
   deleted: (at p20 c7)
   added: (in p20 a3)
   goals met: 19 of 24
68. (fly a3 c7 c2 f1 f0)
   deleted: (at a3 c7) (fuel-level a3 f1)
   added: (at a3 c2) (fuel-level a3 f0)
   goals met: 19 of 24
69. (debark p20 a3 c2)
   deleted: (in p20 a3)
   added: (at p20 c2)
   goals met: 20 of 24
70. (fly a1 c3 c5 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 21 of 24
71. (board p21 a1 c5)
   deleted: (at p21 c5)
   added: (in p21 a1)
   goals met: 21 of 24
72. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 21 of 24
73. (fly a1 c5 c7 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c7) (fuel-level a1 f1)
   goals met: 20 of 24
74. (debark p21 a1 c7)
   deleted: (in p21 a1)
   added: (at p21 c7)
   goals met: 21 of 24
75. (fly a1 c7 c5 f1 f0)
   deleted: (at a1 c7) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 22 of 24
76. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 22 of 24
77. (fly a2 c1 c4 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c4) (fuel-level a2 f1)
   goals met: 23 of 24
78. (refuel a3 f0 f2)
   deleted: (fuel-level a3 f0)
   added: (fuel-level a3 f2)
   goals met: 23 of 24
79. (fly a3 c2 c4 f2 f1)
   deleted: (at a3 c2) (fuel-level a3 f2)
   added: (at a3 c4) (fuel-level a3 f1)
   goals met: 24 of 24
